In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats

A physician is evaluating a new diet for her patients with a family history of
heart disease. To test the effectiveness of this diet, 16 patients are placed on the
diet for 6 months. Their weights and triglyceride levels are measured before
and after the study, and the physician wants to know if either set of
measurements has changed. (Data set: dietstudy.csv)

In [2]:
dit=pd.read_csv('dietstudy.csv')
dit.head()

   patid  age  gender  tg0  tg1  tg2  tg3  tg4  wgt0  wgt1  wgt2  wgt3  wgt4
0      1   45    Male  180  148  106  113  100   198   196   193   188   192
1      2   56    Male  139   94  119   75   92   237   233   232   228   225
2      3   50    Male  152  185   86  149  118   233   231   229   228   226
3      4   46  Female  112  145  136  149   82   179   181   177   174   172
4      5   64    Male  156  104  157   79   97   219   217   215   213   214

In [3]:
dit=dit.drop(['patid'],axis=1)

Null hypothesis: There is no difference in the levels of Triglycerides and weight of individual after using new diet for 6 months.

Null hypothesis: There is has been a significant difference in the levels of Triglycerides and weight of individual after using new diet for 6 months.

CI: 95%, p: 0.05
        
Test:t-test (paired sample)

In [4]:
print( 'Mean pre_usage: ', dit.tg0.mean(),
            '| Mean post_usage: ', dit.tg4.mean())
print( 'Mean pre_usage: ', dit.wgt0.mean(),
            '| Mean post_usage: ', dit.wgt4.mean())

Mean pre_usage:  138.4375 | Mean post_usage:  124.375
Mean pre_usage:  198.375 | Mean post_usage:  190.3125

In [5]:
stats.ttest_rel( dit.tg0,dit.tg4)

Ttest_relResult(statistic=1.2000008533342437, pvalue=0.24874946576903698)

In [6]:
stats.ttest_rel(dit.wgt0,dit.wgt4)

Ttest_relResult(statistic=11.174521688532522, pvalue=1.137689414996614e-08)

# Independent-Samples T Test

An analyst at a department store wants to evaluate a recent credit card
promotion. To this end, 500 cardholders were randomly selected. Half received
an ad promoting a reduced interest rate on purchases made over the next three
months, and half received a standard seasonal ad. Is the promotion effective to
increase sales?

In [7]:
cred=pd.read_csv('creditpromo.csv')

In [8]:
cred.head()

     id         insert      dollars
0   148       Standard  2232.771979
1   572  New Promotion  1403.807542
2   973       Standard  2327.092181
3  1096       Standard  1280.030541
4  1541  New Promotion  1513.563200

In [9]:
var= 'dollars'
a=cred.loc[cred['insert'] =='Standard',var]
b=cred.loc[cred['insert'] =='New Promotion',var]

In [10]:
 print( 'Standard avg: ',cred[cred['insert'] == 'Standard']['dollars'].mean().round(2))
 print( 'New Promotion: ',cred[cred['insert'] == 'New Promotion']['dollars'].mean().round(2))

Standard avg:  1566.39
New Promotion:  1637.5

In [11]:
 print( ' Standard avg: ',cred[cred['insert'] == 'Standard']['dollars'].var().round(2))
 print( 'New Promotion: ',cred[cred['insert'] == 'New Promotion']['dollars'].var().round(2))

 Standard avg:  120182.2
New Promotion:  127237.15

In [12]:
stats.ttest_ind( a,b )

Ttest_indResult(statistic=-2.2604227264649963, pvalue=0.024225996894147814)

Since the p-values is less than 0.05 for 95% confidence interval, we reject the null hypothesis

 An experiment is conducted to study the hybrid seed production of bottle gourd
under open field conditions. The main aim of the investigation is to compare
natural pollination and hand pollination. The data are collected on 10 randomly
selected plants from each of natural pollination and hand pollination. The data
are collected on fruit weight (kg), seed yield/plant (g) and seedling length (cm)

In [13]:
dfp=pd.read_csv('pollination.csv')

In [14]:
dfp.head()

     Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0  Natural      1.85            147.70            16.86
1  Natural      1.86            136.86            16.77
2  Natural      1.83            149.97            16.35
3  Natural      1.89            172.33            18.26
4  Natural      1.80            144.46            17.90

In [15]:
dfp['Seed_Yield_Plant'].mean()

180.8035

In [16]:
dfp.Group.unique()

array(['Natural', 'Hand'], dtype=object)

Null hypothesis: Natural and hand pollination are equally effective.

Alternate hypothesis: They are significantly different.

In [17]:
dfp

      Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0   Natural      1.85            147.70            16.86
1   Natural      1.86            136.86            16.77
2   Natural      1.83            149.97            16.35
3   Natural      1.89            172.33            18.26
4   Natural      1.80            144.46            17.90
5   Natural      1.88            138.30            16.95
6   Natural      1.89            150.58            18.15
7   Natural      1.79            140.99            18.86
8   Natural      1.85            140.57            18.39
9   Natural      1.84            138.33            18.58
10     Hand      2.58            224.26            18.18
11     Hand      2.74            197.50            18.07
12     Hand      2.58            230.34            19.07
13     Hand      2.62            217.05            19.00
14     Hand      2.68            233.84            18.00
15     Hand      2.56            216.52            18.49
16     Hand      2.34            211.93            17.45
17     Hand      2.67            210.37            18.97
18     Hand      2.45            199.87            19.31
19     Hand      2.44            214.30            19.36

# a. Is the overall population of Seed yield/plant (g) equals to 200?

In [18]:
dfp['Seed_Yield_Plant'].mean()

180.8035

 The mean of Seed yield/plant for the whole population is not 200

Ho: mean <= 200
Ha: mean > 200
    
CI: 95%, p: 0.05
        
Test: 1 - sample t test

In [19]:
stats.ttest_1samp( dfp['Seed_Yield_Plant'], 50 )

Ttest_1sampResult(statistic=15.678241300416927, pvalue=2.522080528618035e-12)

# b. Test whether the natural pollination and hand pollination under open field conditions are equally effective or are significantly different.

In [20]:
dfp.columns

Index(['Group', 'Fruit_Wt', 'Seed_Yield_Plant', 'Seedling_length'], dtype='object')

In [21]:
a1=dfp.loc[dfp['Group'] =='Natural','Fruit_Wt']
b1=dfp.loc[dfp['Group'] =='Hand','Fruit_Wt']
print( 'Natural avg: ', round(a1.mean(), 2),'of Fruit_Wt', 
          ' | Hand avg: ', round(b1.mean(), 2),'of Fruit_Wt')
print( 'Natural var: ', round(a1.var(), 2),'of Fruit_Wt', 
          ' | Hand var: ', round(b1.var(), 2),'of Fruit_Wt')
print(stats.ttest_ind( a1, b1),'of Fruit_Wt')

Natural avg:  1.85 of Fruit_Wt  | Hand avg:  2.57 of Fruit_Wt
Natural var:  0.0 of Fruit_Wt  | Hand var:  0.02 of Fruit_Wt
Ttest_indResult(statistic=-17.669989614440286, pvalue=8.078362076486221e-13) of Fruit_Wt

In [22]:
a2=dfp.loc[dfp['Group'] =='Natural','Seed_Yield_Plant']
b2=dfp.loc[dfp['Group'] =='Hand','Seed_Yield_Plant']
print( 'Natural avg: ', round(a2.mean(), 2),'of Seed_Yield_Plant', 
          ' | Hand avg: ', round(b2.mean(), 2),'of Seed_Yield_Plant')
print( 'Natural var: ', round(a2.var(), 2), 'of Seed_Yield_Plant',
          ' | Hand var: ', round(b2.var(), 2),'of Seed_Yield_Plant')
print(stats.ttest_ind( a2, b2),'of Seed_Yield_Plant')

Natural avg:  146.01 of Seed_Yield_Plant  | Hand avg:  215.6 of Seed_Yield_Plant
Natural var:  110.17 of Seed_Yield_Plant  | Hand var:  138.38 of Seed_Yield_Plant
Ttest_indResult(statistic=-13.958260515902547, pvalue=4.271481585484385e-11) of Seed_Yield_Plant

In [23]:
a3=dfp.loc[dfp['Group'] =='Natural','Seedling_length']
b3=dfp.loc[dfp['Group'] =='Hand','Seedling_length']
print( 'Natural avg: ', round(a3.mean(), 2),'of Seedling_length', 
          ' | Hand avg: ', round(b3.mean(), 2),'of Seedling_length')
print( 'Natural var: ', round(a3.var(), 2), 'of Seedling_length',
          ' | Hand var: ', round(b3.var(), 2),'of Seedling_length')
print(stats.ttest_ind( a3, b3),'of Seedling_length')

Natural avg:  17.71 of Seedling_length  | Hand avg:  18.59 of Seedling_length
Natural var:  0.79 of Seedling_length  | Hand var:  0.42 of Seedling_length
Ttest_indResult(statistic=-2.542229999657055, pvalue=0.020428817064110226) of Seedling_length

*Since in all 3 cases p-value is less than 0.05 we reject the null hypothesis*

4. An electronics firm is developing a new DVD player in response to customer
requests. Using a prototype, the marketing team has collected focus data for
different age groups viz. Under 25; 25-34; 35-44; 45-54; 55-64; 65 and above.
Do you think that consumers of various ages rated the design differently?
(Data set: dvdplayer.csv

Null Hypothesis: Consumers from different age-groups rated the design similarly.

Alternate Hypothesis: Consumers from different age-groups rated the design differently.

In [24]:
dvd=pd.read_csv('dvdplayer.csv')

In [25]:
dvd.head()

      agegroup   dvdscore
0  65 and over  38.454803
1        55-64  17.669677
2  65 and over  31.704307
3  65 and over  25.924460
4     Under 25  30.450007

# Applying ANOVA

In [26]:
dvd.agegroup.unique()

array(['65 and over', '55-64', 'Under 25', '25-34', '45-54', '35-44'],
      dtype=object)

In [27]:
f1 = dvd.loc[dvd.agegroup == '65 and over', 'dvdscore']
f2 = dvd.loc[dvd.agegroup == '55-64', 'dvdscore']
f3 = dvd.loc[dvd.agegroup == '45-54', 'dvdscore']
f4 = dvd.loc[dvd.agegroup == '35-44', 'dvdscore']
f5 = dvd.loc[dvd.agegroup == '25-34', 'dvdscore']
f6 = dvd.loc[dvd.agegroup == 'Under 25', 'dvdscore']

In [28]:
print( 'mean f1:', round(f1.mean(), 2), 
          '| mean f2:', round(f2.mean(), 2), 
              '| mean f3:', round(f3.mean(), 2),
                '| mean f4:', round(f4.mean(), 2), 
                      '| mean f5:', round(f5.mean(), 2), 
                              '| mean f6:', round(f6.mean(), 2))

mean f1: 28.0 | mean f2: 28.45 | mean f3: 39.12 | mean f4: 37.02 | mean f5: 31.68 | mean f6: 28.75

In [29]:
print( 'mean f1:', round(f1.var(), 2), 
          '| mean f2:', round(f2.var(), 2), 
              '| mean f3:', round(f3.var(), 2),
                '| mean f4:', round(f4.var(), 2), 
                      '| mean f5:', round(f5.var(), 2), 
                              '| mean f6:', round(f6.var(), 2))

mean f1: 27.72 | mean f2: 29.52 | mean f3: 41.38 | mean f4: 63.78 | mean f5: 34.08 | mean f6: 26.98

In [30]:
stats.f_oneway(f1, f2, f3,f4,f5,f6)

F_onewayResult(statistic=6.992526962676514, pvalue=3.087324905679639e-05)

5. A survey was conducted among 2800 customers on several demographic
characteristics. Working status, sex, age, age-group, race, happiness, no. of
child, marital status, educational qualifications, income group etc. had been
captured for that purpose. (Data set: sample_survey.csv).

a. Is there any relationship in between labour force status with marital status?

b. Do you think educational qualification is somehow controlling the marital
status?

c. Is happiness is driven by earnings or marital status?

In [31]:
sam=pd.read_csv('sample_survey.csv')
sam.head()

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese
2,3,Working full time,Married,2.0,36.0,12.0,12.0,12.0,16.0,High school,...,35 to 44,1-2,No,No,No,Yes,Yes,American,American,NaN
3,4,Working full time,Never married,0.0,21.0,13.0,NaN,12.0,NaN,High school,...,Less than 25,None,No,No,No,Yes,Yes,American,Other,NaN
4,5,Working full time,Never married,0.0,35.0,16.0,NaN,12.0,NaN,Bachelor,...,35 to 44,None,No,No,No,No,No,American,American,Korean

In [32]:
sam.columns

Index(['id', 'wrkstat', 'marital', 'childs', 'age', 'educ', 'paeduc', 'maeduc',
       'speduc', 'degree', 'sex', 'race', 'born', 'parborn', 'granborn',
       'income', 'rincome', 'polviews', 'cappun', 'postlife', 'happy',
       'hapmar', 'owngun', 'news', 'tvhours', 'howpaid', 'ethnic', 'eth1',
       'eth2', 'eth3', 'confinan', 'conbus', 'coneduc', 'conpress', 'conmedic',
       'contv', 'agecat', 'childcat', 'news1', 'news2', 'news3', 'news4',
       'news5', 'car1', 'car2', 'car3'],
      dtype='object')

In [33]:

    #This function will compute frequency table of x an yPandas Series, and use the table to feed for the contigency table
    #Parameters:
    #-------
    #x,y : Pandas Series, must be same shape for frequency table
    
    #Return:
    #-------
    #None. But prints out frequency table, chi2 test statistic, and  p-value

In [34]:
def compute_freq_chi2(x,y):
    freqtab = pd.crosstab(x,y)
    print("Frequency table")
    print("============================")
    print(freqtab)
    print("============================")
    chi2,pval,dof,expected = stats.chi2_contingency(freqtab)
    print("ChiSquare test statistic: ",chi2)
    print("p-value: ",pval)
    return

# apply Chi-square test of independence!

Null Hypothesis: There is no relationship between labour force status and marital status.
    
Alternate Hypothesis: A relationship exists between labour force status and marital status.

In [35]:
compute_freq_chi2(sam.marital, sam.wrkstat)

Frequency table
============================
wrkstat        Keeping house  Other  Retired  School  Temporarily not working  \
marital
Divorced                  25     12       53       7                        9
Married                  200     16      168       9                       23
Never married             35     14       17      60                       11
Separated                 13      4        6       2                        1
Widowed                   55      8      150       1                        2

wrkstat        Unemployed, laid off  Working full time  Working part-time
marital
Divorced                         10                295                 35
Married                          13                778                138
Never married                    32                392                102
Separated                         0                 58                  9
Widowed                           3                 44                 20
============================
ChiSquare test statistic:  729.2421426572284
p-value:  1.4875268409067568e-135


Since p-value is less than 0.05 for 95% confidence interval.

Therefore, we reject the null hypothesis.

==========================================================================

Null Hypothesis: There is no relationship between educational qualification and marital status.
    
Alternate Hypothesis: A relationship exists between educational qualification and marital status.

In [36]:
compute_freq_chi2(sam.degree, sam.marital)

Frequency table
============================
marital         Divorced  Married  Never married  Separated  Widowed
degree
Bachelor              58      251            129         12       28
Graduate              29      123             41          3        9
High school          241      686            367         58      148
Junior college        45      108             46          3        6
LT High school        70      174             77         17       92
============================
ChiSquare test statistic:  122.68449020508541
p-value:  1.6707923432360119e-18

Null Hypothesis: Happiness is not driven by both income and marital status.
    
Alternate Hypothesis: Happiness is driven by both income and /or marital status.

In [37]:
compute_freq_chi2(sam.happy, sam.marital)

Frequency table
============================
marital        Divorced  Married  Never married  Separated  Widowed
happy
Not too happy        72       71            108         30       59
Pretty happy        278      684            426         49      137
Very happy           93      582            120         13       83
============================
ChiSquare test statistic:  260.6894389418282
p-value:  9.3147261197964e-52

In [38]:
compute_freq_chi2(sam.happy, sam.income)

Frequency table
============================
income         $1000 TO 2999  $10000 - 14999  $15000 - 19999  $20000 - 24999  \
happy
Not too happy              7              39              33              40
Pretty happy              20             107             119             155
Very happy                 5              44              26              50

income         $25000 or more  $3000 TO 3999  $4000 TO 4999  $5000 TO 5999  \
happy
Not too happy             113              9              9              6
Pretty happy              888             11             13             18
Very happy                571              4             10             11

income         $6000 TO 6999  $7000 TO 7999  $8000 TO 9999  LT $1000
happy
Not too happy             14             12              9        11
Pretty happy              13             21             30        13
Very happy                 6             14             19        11
============================
ChiSquare test statistic:  178.9505306121643
p-value:  1.4107677273473057e-26